package ru.iammaxim.InDaCellsServer.Quests;

public class QuestLines {
    //Most Important
    public final static String _talk_with = "Поговорите: ";
    public final static String _kill = "Убейте: ";
    public final static String _find = "Найдите: ";
    public final static String _go_back = "Вернитесь: ";

    public final static String raiders_1_georg_intro_speech = "Здравствуй, нехилое было побоище, да? Что побудило тебя атаковать этих... А впрочем неважно, у каждого из нас свои причины. Я так понял ты хочешь пополнить наши ряды? Что ж, свою ненависть к этим псевдомиротворцам ты показал, а сможешь показать верность нам? Два мусорщика, поставлявшие нам ресурсы, куда-то запропастились, найди их, и, если они слились... Думаю ты знаешь что нужно делать.";
    public final static String raiders_1_lftrashers = "Найдите ближайшее поселение мусорщиков. Говорят она обитают около берега.";
    public final static String raiders_1_tim = "Что? Мой напарник торговал с тобой в городе, как ты оказался среди них? Впрочем, это уже неважно. Мы больше не будем поставлять \"вашим\" припасы, Горо был убит рейдерами в недавней потасовке, нам не хочется больше рисковать...";
    public final static String raiders_1_finish = "Вот как вышло... Что-ж, хорошая работа.";

    public final static String raiders_ramms_weapon_intro = "Рамм столкнулся с проблемой, Рамм нуждается в помощи. Рамм потерял свою дубину. Рамм не останется в долгу.";
    public final static String raiders_ramms_weapon_finish = "ААААГРХ! Рамм скучал по дубине. За то, что ты принес её, Рамм не будет тебя бить.";

    public final static String peacemakers_1_intro = "Фух, ну и бойня... А ты неплохо себя показал. Пора бы тебе пополнить ряды наших стражей порядка. Но для этого, тебе нужно пройти, кхм, испытание. Отправляйся на юг, с тех ферм поступил сигнал тревоги. Покажи, на что ты способен.";
    public final static String peacemakers_1_find_beggars = "Отправляйтесь на юг, найдите местных рейдеров и устраните их.";
    public final static String peacemakers_1_tod_speech = "Огогогкххххрр... Как ты ловко управился с этими неудачниками! Без тебя, мы остались бы без пропитания. Надеюсь, ты не из тех миротворцев, которые забирают оставшуюся пищу?" +
            "\n..static ." +
            "\nЧтstatic о-ж.. Прошу оставь хоть на неделю, я понимаю, вам кормить город, но я простой фермер, мертвый фермер не принесет вам плодов...";
    public final static String peacemakers_1_finish = "А ты хороший добытчик. Правда тебе стоит быть помягче с рабочим классом. Что-ж, ты хорошо поработал, ты принят.";

    public final static String peacemakers_jo_dogs_intro = "Эй, новенький, как тебя там... Иди сюда, нужна твоя помощь. С восточной стороны напали дикие псы, разберись с этим. Без награды не останешься. Иди.";
    public final static String peacemakers_jo_dogs_finish = "А ты неплохо справляешься! Спасибо.";
}